jake5253/grblHAL_HC32F460/boards/voxelab_aquila_v1_0_2_map.h
/*
  voxelab_aquila_v1_0_2_map.h - Voxelab Aquila main board v1.0.2 pin map

  Board ID: FFP0173_Aquila_Main_Board_V1.0.2

  Part of grblHAL
*/

#pragma once

#define BOARD_NAME              "Voxelab Aquila V1.0.2 (HC32F460)"

#ifndef BUILD_INFO_BASE
#define BUILD_INFO_BASE         "FFP0173_Aquila_Main_Board_V1.0.2"
#endif

// Board-default machine profile for the stock Aquila kinematics.
// These values become active after reflashing and resetting settings with $RST=*.
#define DEFAULT_X_STEPS_PER_MM  800.0f
#define DEFAULT_Y_STEPS_PER_MM  800.0f
#define DEFAULT_Z_STEPS_PER_MM  800.0f

#define DEFAULT_X_MAX_RATE      1200.0f
#define DEFAULT_Y_MAX_RATE      1200.0f
#define DEFAULT_Z_MAX_RATE      800.0f

#define DEFAULT_X_ACCELERATION  300.0f
#define DEFAULT_Y_ACCELERATION  300.0f
#define DEFAULT_Z_ACCELERATION  100.0f

#define DEFAULT_X_MAX_TRAVEL    300.0f
#define DEFAULT_Y_MAX_TRAVEL    200.0f
#define DEFAULT_Z_MAX_TRAVEL    45.0f

#define DEFAULT_DIR_SIGNALS_INVERT_MASK 2
#define DEFAULT_ENABLE_SIGNALS_INVERT_MASK 7
#define DEFAULT_HARD_LIMIT_ENABLE 1
#define DEFAULT_HOMING_ENABLE 1
#define DEFAULT_HOMING_DIR_MASK 3

#define DEFAULT_SPINDLE_PWM_FREQ 40000

// Optional direct-MCU control inputs on the display header.
// Uncomment or provide via build flags when external conditioning is present.
//#define CONTROL_ENABLE          (CONTROL_HALT|CONTROL_FEED_HOLD|CONTROL_CYCLE_START)

// Common useful build-time overrides for this board:
// -D USE_USART=1
//     Route the main serial console to USART1 on PC0/PC1 instead of USART2 on PA9/PA15.
// -D USE_USART=2
//     Use the default console on USART2 on PA9/PA15.
// -D MPG_ENABLE=2
//     Enable UART MPG mode on the non-primary USART using real-time command switchover.
// -D KEYPAD_ENABLE=2
//     Enable experimental UART keypad mode on the non-primary USART.
//     This is integrated and build-tested, but not yet validated on HC32 hardware.
// -D PROBE_ENABLE=0
//     Disable the dedicated probe input and build without probe support.
// -D CONTROL_ENABLE=(CONTROL_HALT|CONTROL_FEED_HOLD|CONTROL_CYCLE_START)
//     Enable halt/feed-hold/cycle-start on PB12/PB13/PB14.
// -D ESTOP_ENABLE=1
//     Make the halt input behave as a physical e-stop instead of a reset input.
// -D EEPROM_ENABLE=0
//     Use internal flash-backed NVS instead of the external EEPROM on PA11/PA12.
// -D N_SPINDLE=1
//     Build without the secondary spindle / laser registration.
// -D N_SPINDLE=2 -D SPINDLE1_ENABLE=SPINDLE_PWM1_NODIR
//     Enable the secondary PWM spindle / laser on PB1.
// -D SPINDLE_SELECT_ENABLE=0
//     Disable the local runtime spindle-selection addon even when multiple spindles are built.
// -D FANS_ENABLE=1
//     Enable the upstream fans plugin submodule. Fan mapping is handled through aux port settings.
// -D ODOMETER_ENABLE=1
//     Enable the upstream odometer plugin submodule. Use with EEPROM_ENABLE=1; flash-backed NVS is not suitable.
// -D N_AXIS=4
//     Repurpose the Aquila E-stepper socket as an optional A axis on PB4/PB3.
//     This axis has no dedicated limit/home input and should be tuned/reset separately after flashing.

// Main serial console defaults to the onboard CH340 / micro USB path on USART2.
// Set USE_USART=1 to use the display header PC0/PC1 pins instead.

#if USE_USART == 1
#define SERIAL_PORT             1
#define SERIAL1_PORT            2
#define SERIAL_PORT_USART       usart(1)
#define SERIAL_PORT_TX          PortC
#define SERIAL_PORT_TX_PIN      Pin00
#define SERIAL_PORT_TX_FUNC     Func_Usart1_Tx
#define SERIAL_PORT_RX          PortC
#define SERIAL_PORT_RX_PIN      Pin01
#define SERIAL_PORT_RX_FUNC     Func_Usart1_Rx
#define SERIAL_PORT_RI          INT_USART1_RI
#define SERIAL_PORT_TI          INT_USART1_TI
#define SERIAL_PORT_EI          INT_USART1_EI
#define SERIAL_PORT_TCI         INT_USART1_TCI
#define SERIAL_PORT_CLOCKS      (PWC_FCG1_PERIPH_USART1)
#define SERIAL_PORT_LABEL       "USART1"
#define SERIAL_AUX_PORT_USART   usart(2)
#define SERIAL_AUX_PORT_TX      PortA
#define SERIAL_AUX_PORT_TX_PIN  Pin09
#define SERIAL_AUX_PORT_TX_FUNC Func_Usart2_Tx
#define SERIAL_AUX_PORT_RX      PortA
#define SERIAL_AUX_PORT_RX_PIN  Pin15
#define SERIAL_AUX_PORT_RX_FUNC Func_Usart2_Rx
#define SERIAL_AUX_PORT_RI      INT_USART2_RI
#define SERIAL_AUX_PORT_TI      INT_USART2_TI
#define SERIAL_AUX_PORT_EI      INT_USART2_EI
#define SERIAL_AUX_PORT_TCI     INT_USART2_TCI
#define SERIAL_AUX_PORT_CLOCKS  (PWC_FCG1_PERIPH_USART2)
#define SERIAL_AUX_PORT_LABEL   "USART2"
#elif USE_USART == 2
#define SERIAL_PORT             2
#define SERIAL1_PORT            1
#define SERIAL_PORT_USART       usart(2)
#define SERIAL_PORT_TX          PortA
#define SERIAL_PORT_TX_PIN      Pin09
#define SERIAL_PORT_TX_FUNC     Func_Usart2_Tx
#define SERIAL_PORT_RX          PortA
#define SERIAL_PORT_RX_PIN      Pin15
#define SERIAL_PORT_RX_FUNC     Func_Usart2_Rx
#define SERIAL_PORT_RI          INT_USART2_RI
#define SERIAL_PORT_TI          INT_USART2_TI
#define SERIAL_PORT_EI          INT_USART2_EI
#define SERIAL_PORT_TCI         INT_USART2_TCI
#define SERIAL_PORT_CLOCKS      (PWC_FCG1_PERIPH_USART2)
#define SERIAL_PORT_LABEL       "USART2"
#define SERIAL_AUX_PORT_USART   usart(1)
#define SERIAL_AUX_PORT_TX      PortC
#define SERIAL_AUX_PORT_TX_PIN  Pin00
#define SERIAL_AUX_PORT_TX_FUNC Func_Usart1_Tx
#define SERIAL_AUX_PORT_RX      PortC
#define SERIAL_AUX_PORT_RX_PIN  Pin01
#define SERIAL_AUX_PORT_RX_FUNC Func_Usart1_Rx
#define SERIAL_AUX_PORT_RI      INT_USART1_RI
#define SERIAL_AUX_PORT_TI      INT_USART1_TI
#define SERIAL_AUX_PORT_EI      INT_USART1_EI
#define SERIAL_AUX_PORT_TCI     INT_USART1_TCI
#define SERIAL_AUX_PORT_CLOCKS  (PWC_FCG1_PERIPH_USART1)
#define SERIAL_AUX_PORT_LABEL   "USART1"
#else
#error "USE_USART must be set to 1 or 2"
#endif

// External 24C16 EEPROM on I2C-0.
#define EEPROM_SDA_PORT         PortA
#define EEPROM_SDA_PIN          Pin11
#define EEPROM_SCL_PORT         PortA
#define EEPROM_SCL_PIN          Pin12

// Shared stepper enable plus X/Y/Z motion pins.
#define X_STEP_PORT             PortC
#define X_STEP_PIN              Pin02
#define Y_STEP_PORT             PortB
#define Y_STEP_PIN              Pin08
#define Z_STEP_PORT             PortB
#define Z_STEP_PIN              Pin06

#define X_DIRECTION_PORT        PortB
#define X_DIRECTION_PIN         Pin09
#define Y_DIRECTION_PORT        PortB
#define Y_DIRECTION_PIN         Pin07
#define Z_DIRECTION_PORT        PortB
#define Z_DIRECTION_PIN         Pin05

#if N_AXIS > 3
#define M3_AVAILABLE            1
#define M3_STEP_PORT            PortB
#define M3_STEP_PIN             Pin04
#define M3_DIRECTION_PORT       PortB
#define M3_DIRECTION_PIN        Pin03
#endif

#define STEPPERS_ENABLE_PORT    PortC
#define STEPPERS_ENABLE_PIN     Pin03

// Endstop / probe headers.
#define X_LIMIT_PORT            PortA
#define X_LIMIT_PIN             Pin05
#define Y_LIMIT_PORT            PortA
#define Y_LIMIT_PIN             Pin06
#define Z_LIMIT_PORT            PortA
#define Z_LIMIT_PIN             Pin07

// Use PA7 as a dedicated Z limit. PA4 is a safer probe candidate than the thermistor inputs.
#define PROBE_PORT              PortA
#define PROBE_PIN               Pin04

// Default functional assignment: primary spindle PWM on the HEAD terminal block.
#define SPINDLE0_PWM_PORT       PortA
#define SPINDLE0_PWM_PIN        Pin01
#define SPINDLE0_PWM_FUNC       Func_Tima0
#define SPINDLE0_PWM_TIMER      timer(2)
#define SPINDLE0_PWM_CLOCK      PWC_FCG2_PERIPH_TIMA2
#define SPINDLE0_PWM_CHANNEL    TimeraCh2
#define SPINDLE0_HAS_ENABLE     0
#define SPINDLE0_HAS_DIRECTION  0

// Compatibility aliases for the primary spindle expected by grblHAL's generic option layer.
#define SPINDLE_PWM_PORT        SPINDLE0_PWM_PORT
#define SPINDLE_PWM_PIN         SPINDLE0_PWM_PIN
#define SPINDLE_PWM_FUNC        SPINDLE0_PWM_FUNC
#define SPINDLE_ENABLE_PORT     SPINDLE0_PWM_PORT
#define SPINDLE_ENABLE_PIN      SPINDLE0_PWM_PIN

// Secondary PWM spindle / laser on the BLTouch connector.
// Use PB1 as the sole laser control signal; main laser power is handled externally.
#define SPINDLE1_PWM_PORT       PortB
#define SPINDLE1_PWM_PIN        Pin01
#define SPINDLE1_PWM_FUNC       Func_Tima0
#define SPINDLE1_PWM_TIMER      timer(1)
#define SPINDLE1_PWM_CLOCK      PWC_FCG2_PERIPH_TIMA1
#define SPINDLE1_PWM_CHANNEL    TimeraCh7
#define SPINDLE1_HAS_ENABLE     0
#define SPINDLE1_HAS_DIRECTION  0

// PA0 is left available for auxiliary output / fan plugin use instead of being
// hard-assigned as coolant flood on this board.

// Optional direct-MCU control inputs on the display header.
#define CONTROL_PORT            PortB
#if CONTROL_ENABLE & CONTROL_HALT
#define RESET_PIN               Pin12
#endif
#if CONTROL_ENABLE & CONTROL_FEED_HOLD
#define FEED_HOLD_PIN           Pin13
#endif
#if CONTROL_ENABLE & CONTROL_CYCLE_START
#define CYCLE_START_PIN         Pin14
#endif

#if SDCARD_ENABLE
#define SDCARD_SDIO             1
#define SDIOC_UNIT              M4_SDIOC1
#define SDIOC_CLOCK             PWC_FCG1_PERIPH_SDIOC1
#define SDIOC_CK_PORT           PortC
#define SDIOC_CK_PIN            Pin12
#define SDIOC_CMD_PORT          PortD
#define SDIOC_CMD_PIN           Pin02
#define SDIOC_D0_PORT           PortC
#define SDIOC_D0_PIN            Pin08
#define SDIOC_D1_PORT           PortC
#define SDIOC_D1_PIN            Pin09
#define SDIOC_D2_PORT           PortC
#define SDIOC_D2_PIN            Pin10
#define SDIOC_D3_PORT           PortC
#define SDIOC_D3_PIN            Pin11
#define SD_DETECT_PORT          PortA
#define SD_DETECT_PIN           Pin10
#define SDIOC_DETECT_VIA_GPIO   1
#endif

/*
  Aquila V1.0.1 / V1.0.2 board notes:

  Known major ICs:
  - HC32F460KCTA MCU
  - 24C16 I2C EEPROM on PA11/PA12
  - CH340G USB/UART bridge on PA9/PA15
  - Four MS35775 stepper drivers (TMC2208-class clones)

  Motion hardware:
  - X: PC2 step, PB9 dir
  - Y: PB8 step, PB7 dir
  - Z: PB6 step, PB5 dir
  - E0: PB4 step, PB3 dir
  - Shared stepper enable: PC3
  - Driver strap resistors indicate fixed 1/16 microstepping

  High-current outputs:
  - PA0 switches both the part-cooling and motherboard fans in parallel
  - PA1 switches the hotend heater MOSFET
  - PA2 switches the heated-bed MOSFET

  Sensor / IO headers:
  - Filament runout: PA4
  - Endstops: PA5/PA6/PA7 for X/Y/Z
  - Thermistors: PC4 bed, PC5 hotend
  - BLTouch: PB0 servo, PB1 probe input
  - SDIO: PC8-PC11 data, PC12 clock, PD2 cmd, PA10 detect

  Accessible expansion candidates:
  - BLTouch servo pin PB0 if probing servo output is not needed
  - LCD connector pins PC0/PC1 and PB12-PB15
  - Fan output PA0 and heater output PA2 for non-thermally-managed repurposing

  Misc:
  - Status LED: PA3, active low
  - Crystal: 8 MHz on PH0/PH1
  - SWD: PA13/PA14
*/
